from itertools import cycle

from django.core.management.base import BaseCommand, CommandError
from faker import Faker
from model_bakery import baker

from products.models import Category, Product
from shops.models import Shop

fake = Faker()


class Command(BaseCommand):
    help = 'Closes the specified poll for voting'

    def add_arguments(self, parser):
        parser.add_argument('category', nargs='+', type=int)
        parser.add_argument('product', nargs='+', type=int)

    def handle(self, *args, **options):
        emoji = ('🎽', '👔', '👚', '👕', '🧣', '🧕🏻',
                 '💻', '🖥', '📱', '📟', '☎', '️📠', '📱', '📺', '✔', '📌', '🏷', '📦', '🚘', '🧊', '❄', '💨', '🌬',
                 '⌚', '🗄',
                 '🆕', '🔴',
                 '🟠', '🟡', '🟢', '🔵', '🟣', '🔘', '🎁', '💧', '🔖', '📕', '📖', '📓', '📔', '📘', '📚', '📙', '📗',
                 '📒',
                 '🔖', '📑',
                 '💄', '💋', '👄', '👅', '🔮', '⚱', '🧬', '🕳', '🧼', '🖌', '🖍', '👛', '👝', '👜', '🎒', '🛄', '🛍',
                 '🍫', '🍟', '🥓', '🍍', '🥙', '🍯', '🥐', '🍬', '🥟', '🥦', '🍙', '🍣', '🥩', '🥗', '🍩', '🍊', '🍨',
                 '🥔',
                 '🍛', '🍌', '🌯',
                 '🍚', '🍜', '🥤', '🍲', '🧆',
                 '🍮', '🌽', '🍧', '🍓', '🥜', '🍢', '🍋', '🥚', '🍖', '🍡', '🍈', '🌶', '🍞', '🥬', '🦑', '🥡', '🍰',
                 '🌭',
                 '🍘', '🍭', '🦀', '🍦', '🥞',
                 '🌮', '🦐', '🍏', '🍿', '🍠', '🍱', '🍆', '🥥', '🌰', '🥑', '🎂', '🥯', '🍝', '🥫', '🧀', '🍇', '🍉',
                 '🥘',
                 '🍕', '🥝', '🍐', '🥨', '🍒',
                 '🍤', '🍪', '🥖', '🥣', '🍅', '🍎', '🍳', '🍲', '🥠', '🦞', '🍗', '🍥', '🥕', '🍑', '🧂', '🥭', '🥧',
                 '🥪',
                 '😋', '🥒', '🧁', '🍄', '🍔', '🥮',
                 '📺', '📻', '⏰', '🕰', '📡', '🗑', '🔦', '🔧', '🔩', '⚙', '️⛏', '🛠', '⚒', '🔨', '🔪', '🗡', '⚔', '️⚰',
                 '️🧱',
                 '🔭', '🧯',
                 '🚽', '🚰', '🚿', '🔬', '🛁', '🛀', '🧺', '🛎', '🧻', '🛌', '🛏', '🎁', '🛒', '🧳',
                 '🚪', '🧳', '🛌', '🛏',
                 '🤾', '🚴', '🤸', '️⛳', '🏌', '️️🏌', '️🏃', '️🤸', '🤾', '🏄', '‍🧘', '‍🏑', '💪', '🥅', '🤾', '️🏇',
                 '🤽',
                 '️🎾', '🛷',
                 '🥍', '⛹', '️⚾', '🤼', '🏀', '🎱', '🏸', '🚵', '️🏆', '🏉', '🏐', '🚙', '🏟', '🥌',
                 '🏓', '🤺', '🏅', '🎿', '🏊', '️🥉', '🏃', '‍️🏋', '️‍️🏒', '🤼', '️🤼', '‍️🥈', '🏊', '‍️🚣', '‍️🤽',
                 '‍️🏈',
                 '🚴‍', '️🎯', '🏏', '⛷',
                 '🎣', '🏄', '‍️🤸', '🥋', '🏋', '️‍️🥎', '🎳', '🎽', '🥇', '🚣', '‍️🏂', '⛹️‍', '️🥊', '⛸',
                 '🧸', '🐻', '🦊', '🐹', '🐷', '🦄', '🐇', '🐿', '⛄', '️🚌', '🚎', '🚚', '✈', '️🚀', '🚁', '🛳',
                 '💿', '💾', '✉', '📩', '📨', '📧', '💌', '📥', '📤', '📦', '🏷', '📪', '📫', '📬', '📭', '📮', '📯',
                 '📜',
                 '📃', '📄', '📑',
                 '📊', '📈', '📉', '🗒', '🗓', '📆', '📅', '📇', '🗃', '🔏', '🔐', '🔒', '🔓',
                 '🗳', '🗄', '📋', '📁', '📂', '🗂', '🗞', '📰', '📓', '📔', '📒', '📕', '📗', '📘', '📙', '📚', '📖',
                 '🔖',
                 '🔗', '📎', '🖇', '📐',
                 '📏', '📌', '📍', '✂', '🖊', '🖋', '✒', '🖌', '🖍', '📝', '✏', '️🔍', '🔎',
                 '🐶', '🐱', '🐭', '🐹', '🐰', '🦊', '🦝', '🐻', '🐼', '🦘', '🦡', '🐨', '🐯', '🦁', '🐮', '🐷', '🐽',
                 '🐸',
                 '🐵', '🙈', '🙉', '🙊',
                 '🐒', '🐔', '🐧',
                 '🦢', '🦅', '🦉', '🦚', '🦜', '🦇', '🐺', '🐗', '🐴', '🦄', '🐝', '🐛', '🦋', '🐌', '🐚', '🐞', '🐜',
                 '🦗',
                 '🕷', '🕸', '🦂', '🦟', '🦠', '🐢', '🐍',

                 '🦐', '🦀', '🐡', '🐠', '🐟', '🐬', '🐳', '🐋', '🦈', '🐊', '🐅', '🐆', '🦓', '🦍', '🐘', '🦏', '🦛',
                 '🐪', '🐫',
                 '🦙', '🐤', '🐣', '🐥', '🦆', '🐦', '🦎', '🐀', '🐿', '🦔', '🐾', '🦕', '🐙', '🦑', '🦖', '⚡' '🦒',
                 '🐃', '🐂',
                 '🐄', '🐎', '🐖', '🐏', '🐑', '🐐', '🦌', '🐕', '🐩', '🐈', '🐓', '🦃', '🕊', '🐇', '🐁',)
        c = options.get('category', default=10)[0]
        p = options.get('product', default=30)[0]
        shops = Shop.objects.all()
        baker.make(
            Category,
            name=cycle(fake.sentences(nb=100)),
            description=cycle(fake.sentences(nb=310050)),
            # parent=cycle(regions),
            emoji=cycle(fake.random.choice(emoji)),
            # image='blogs/default.jpg',
            shop=cycle(shops),
            _quantity=c,
            make_m2m=True
        )

        categories = Category.objects.all()

        baker.make(
            Product,
            name=cycle(fake.sentences(nb=100)),
            description=cycle(fake.sentences(nb=310050)),
            category=cycle(categories),
            # image='blogs/default.jpg',
            price=cycle(fake.random_number()),
            in_availability=fake.random.choice((True, False)),
            _quantity=p,
            make_m2m=True
        )
